app/controllers/items_controller.rb

SELECT "items".* FROM "items" WHERE "items"."user_id" = $1  [["user_id", 1]]
---
  def index
    @items = Item.where(user_id: params[:user_id])

SELECT "items".* FROM "items" WHERE "items"."user_id" = $1 AND "items"."category" = $2  [["user_id", 1], ["category", "tops"]]
---
  def category
    @items = Item.where({user_id: params[:user_id],  category: params[:category]})

INSERT INTO "items" ("img", "category", "use", "color", "wear_count", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @item = Item.new(item_params)
    @item.user_id = params[:user_id]

    if @item.save

UPDATE "items" SET "wear_count" = $1, "updated_at" = $2 WHERE "items"."id" = $3  [["wear_count", 8], ["updated_at", "2021-03-03 18:31:59.283694"], ["id", 5]]
---
  def update
    if @item.update(item_params)