app/controllers/users_controller.rb

INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "Uma"], ["created_at", "2021-03-03 18:15:12.280494"], ["updated_at", "2021-03-03 18:15:12.280494"]]
---
  def create
    @user = User.new(user_params)

    if @user.save